["MUMBAI (Reuters) - The Reserve Bank of India on Friday eased lending norms related to certain non-banking finance companies (NBFCs) as liquidity concerns in the sector persist and markets continue to question the viability of some of the firms following the IL&FS debacle. The central bank on Friday said it would allow banks to allocate up to 15 percent of their lending to NBFCs that do not finance infrastructure projects, up from an earlier limit of 10 percent. The move is effective up to Dec. 31, the Reserve Bank of India said in a statement. The relaxation in lending norms by RBI follows worries over tightening credit lines to NBFCs after a series of defaults at India’s Infrastructure Leasing & Financial Services Ltd (IL&FS), spooked markets and led to a major sell-off in the stocks of many NBFCs. Earlier this month, the Indian government stepped in to take control of IL&FS saying it feared its collapse would cause “catastrophic” damage to the financial markets and the economy. This week a loan default by real-estate developer Supertech, based in New Delhi, has further panicked investors, leading to further sell-offs in NBFCs with any potential exposure to real estate. Shares in Dewan Housing Finance Corp Ltd closed down 10.75 percent on Friday, while shares in Indiabulls Housing Finance and Edelweiss Financial Services Ltd fell 17.1 percent and 8.7 percent respectively. Indian markets were shut on Thursday, but Friday’s sell-off came on top of prior declines in the stocks on Wednesday. Supertech’s chairman told a local newspaper on Wednesday that Supertech had overshot its loan service deadline by 15 days to two state-run banks, but he said the firm was still servicing its debt from NBFCs regularly. This followed an Oct. 10 downgrade of its loan facilities by ratings agency Brickwork Ratings which slashed its 18.66 billion rupees ($253.91 million) of bank loans to junk, citing cashflow mismatches on account of a slowdown in the real estate sector. “There is lot of fear and uncertainty among investors and any such default news which could lead to a credit loss is creating more uncertainty,” said Ajay Manglunia, head of fixed income advisory at Edelweiss Financial Services. “Clearly this shows that investors don’t have any more appetite for credit losses in the non-bank finance space.”", "Vegetation is the best resource for protecting eroding stream banks. A creek or stream with limited damage may be stabilized with select plantings. The banks are planted with deep rooted plants that can hold soil in place and can withstand flooding and high-velocity water. Vegetation planted along the creek or stream can be extremely useful in controlling soil erosion, providing wildlife habitat and improving water quality. One way to establish vegetation is through the use of dormant, woody stakes and posts to stabilize the banks and bare-root or transplanted trees can be used on top of the banks. The upper section of the bank should also be planted with deep-rooted vegetation to prevent erosion. Plants may include native shade trees, shrubs, tall grasses or green herbaceous plants. For a more formal look, plant a strip of medium height native grass (2-3 feet) between the creek bank and lawn. When mowing the lawn add a design by mowing a curve along the lawn and planted area. Add color to the edge of the planted area with flowering plants. To view the stream, cut or mow view corridors, and/or make a pathway corridor to the stream. Use wood chips other soft materials that will soak up rain."]